module.exports = {

	// 用户相关错误码
	"1000": "用户名或密码错误",
	"1001": "注册信息不完整",
	"1002": "两次输入的密码不一致",
	"1003": "该用户名或邮箱已经被注册",
	"1004": "用户名至少需要5个字符",
	"1005": "用户名只能使用0-9，a-z，A-Z",
	"1006": "不正确的电子邮箱地址",
	"1007": "该邮箱尚未被注册",
	"1008": "重置密码，两次输入的密码不一致",
	"1009": "修改密码信息填写不完整",
	"1010": "修改密码，两次输入的密码不一致",
	"1011": "修改密码，当前密码不正确",


	"2000": "服务器错误",
	"2001": "服务器错误，注册失败",
	"2002": "服务器错误，登录失败",
	"2003": "服务器错误，添加问题失败",
	"2004": "服务器错误，查找问题失败",
	"2005": "没有找到该问题，404",
	"2006": "服务器错误，重置密码失败",
	"2007": "服务器错误，重置密码失败",
	"2008": "无效的链接地址",
	"2009": "服务器错误，重置密码失败",
	"2010": "服务器错误，修改密码失败"
}